export default {
  loading: 'Загрузка...',
  noFace: 'Лицо не найдено!',
  tooClose: 'Вы держите камеру слишком близко!',
  tooFar: 'Вы держите камеру слишком далеко!',
  offCenter: 'Пожалуйста, расположите лицо по центру.',
  tilted: 'Пожалуйста, держите голову ровно.',
  turned: 'Пожалуйста, поверните лицо прямо к камере.',
  notLooking: 'Смотрите прямо в камеру.',
  mouthOpened: 'Пожалуйста, закройте рот.',
  smiling: 'Пожалуйста, не улыбайтесь.',
  ok: 'Отлично, не шевелитесь!',

  continue: 'Продолжить',

  main: {
    title: 'Оформление',
    enterSMS: 'Введите SMS-код',
    smsWasSent: 'SMS-код был выслан на номер:',
    enterSMSToContinue: 'Введите его ниже, чтобы продолжить.',
    requestCode: 'Запросить код повторно',
    resendTimer: 'До повторной отправки: {time}',
    resendRequest: 'Вы сможете запросить повторную отправку через',
  },

  form: {
    phone: 'Номер телефона',
    passport: 'Серия / номер паспорта',
    birthDate: 'Дата рождения',
    agreement: `Я соглашаюсь с условиями <a href="#" target="_blank">публичной оферты</a> и даю свое согласие на обработку и использование моих персональных данных`,
  },

  confirmations: {
    warning: 'Внимание!',

    backToMain: 'Вас вернёт на страницу авторизации, все заполненные раннее данные не будут сохранены',

    accept: 'Ок',
    reject: 'Отменить',
  },

  rules: {
    required: 'Обязательное поле!',
    minLength: 'Длина должна быть больше {opt}',
    minValue: 'Значение должно быть больше {opt}',
  },

  toast: {
    success: 'Успешно',
    error: 'Ошибка',
    warn: 'Предупреждение',
    info: 'Информация',
  },
};
